Revit 2024 API
ExternalServices.BuiltInExternalServices.AXMImporterService Property
 The external service which permits registration of an alternate implementation for AXM import.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId AXMImporterService { get; }
Visual Basic
Public Shared ReadOnly Property AXMImporterService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ AXMImporterService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace